---
# comment
expression: "47"
result: 47
---
# comment 2
expression: "1+2"
result: 3
---
expression: "0.1+0.1+0.1"
result: 0.3
---
expression: '"Hello World"'
result: "Hello World"
---
expression: '"Hello, "+"John Doe"'
result: "Hello, John Doe"